In [1]:
import pandas as pd
import numpy as np

## DataFrame 제작

In [2]:
year = [str(i) for i in range(2011, 2018)]
ktx_data = pd.DataFrame({'경부': [39060, 39896, 42005, 43621, 41702, 41266, 32427],
                         '호남': [7313, 6967, 6873, 6626, 8675, 10622, 9228],
                         '경전': [3627, 4168, 4088, 4424, 4606, 4984, 5570],
                         '전라': [309, 1771, 1954, 2244, 3146, 3945, 5766],
                         '동해': [None, None, None, None, 2395, 3786, 6667]},
                        index = year)

In [3]:
df1 = pd.DataFrame({'Class1': [95, 92, 98, 100],
                    'Class2': [91, 93, 97, 99]})
df2 = pd.DataFrame({'Class1': [87, 89],
                    'Class2': [89, 90]})
df3 = pd.DataFrame({'Class3': [96, 83, 77, 84]})

In [ ]:
dfA = pd.DataFrame({'A': [32, 74, 90, 15], 
                    'B': [62, 10, 25, 46]})
dfB = pd.DataFrame({'A': [51, 32, 90, 20], 
                    'B':[10, 25, 46, 35]})

## DataFrame 활용 : 데이터 선택

In [4]:
ktx_data.index

Index(['2011', '2012', '2013', '2014', '2015', '2016', '2017'], dtype='object')

In [5]:
ktx_data.columns

Index(['경부', '호남', '경전', '전라', '동해'], dtype='object')

In [6]:
ktx_data.values

array([[39060.,  7313.,  3627.,   309.,    nan],
       [39896.,  6967.,  4168.,  1771.,    nan],
       [42005.,  6873.,  4088.,  1954.,    nan],
       [43621.,  6626.,  4424.,  2244.,    nan],
       [41702.,  8675.,  4606.,  3146.,  2395.],
       [41266., 10622.,  4984.,  3945.,  3786.],
       [32427.,  9228.,  5570.,  5766.,  6667.]])

In [7]:
ktx_data.head(3)

         경부    호남    경전    전라  동해
2011  39060  7313  3627   309 NaN
2012  39896  6967  4168  1771 NaN
2013  42005  6873  4088  1954 NaN

In [8]:
ktx_data.tail(3)

         경부     호남    경전    전라      동해
2015  41702   8675  4606  3146  2395.0
2016  41266  10622  4984  3945  3786.0
2017  32427   9228  5570  5766  6667.0

In [9]:
ktx_data[1:3]

         경부    호남    경전    전라  동해
2012  39896  6967  4168  1771 NaN
2013  42005  6873  4088  1954 NaN

In [10]:
ktx_data.loc['2011'] # loc[index]

경부    39060.0
호남     7313.0
경전     3627.0
전라      309.0
동해        NaN
Name: 2011, dtype: float64

In [11]:
ktx_data.iloc[1]

경부    39896.0
호남     6967.0
경전     4168.0
전라     1771.0
동해        NaN
Name: 2012, dtype: float64

In [12]:
ktx_data['경부'] # 그냥[columns]

2011    39060
2012    39896
2013    42005
2014    43621
2015    41702
2016    41266
2017    32427
Name: 경부, dtype: int64

In [13]:
ktx_data.T

       2011     2012     2013     2014     2015     2016     2017
경부  39060.0  39896.0  42005.0  43621.0  41702.0  41266.0  32427.0
호남   7313.0   6967.0   6873.0   6626.0   8675.0  10622.0   9228.0
경전   3627.0   4168.0   4088.0   4424.0   4606.0   4984.0   5570.0
전라    309.0   1771.0   1954.0   2244.0   3146.0   3945.0   5766.0
동해      NaN      NaN      NaN      NaN   2395.0   3786.0   6667.0

In [14]:
ktx_data['호남'].tolist()

[7313, 6967, 6873, 6626, 8675, 10622, 9228]

## DataFrame 활용: 데이터 통합

In [22]:
pd.concat([df1, df2], ignore_index=True)

   Class1  Class2
0      95      91
1      92      93
2      98      97
3     100      99
4      87      89
5      89      90

In [17]:
df1.join(df3)

   Class1  Class2  Class3
0      95      91      96
1      92      93      83
2      98      97      77
3     100      99      84

In [18]:
dfA.merge(dfB, how='inner', on='A')

    A  B_x  B_y
0  32   62   25
1  90   25   46

In [19]:
dfA.merge(dfB, how='outer', on='A')

    A   B_x   B_y
0  15  46.0   NaN
1  20   NaN  35.0
2  32  62.0  25.0
3  51   NaN  10.0
4  74  10.0   NaN
5  90  25.0  46.0

In [20]:
dfA.merge(dfB, how='left', on='B')

   A_x   B   A_y
0   32  62   NaN
1   74  10  51.0
2   90  25  32.0
3   15  46  90.0

In [21]:
dfA.merge(dfB, how='right', on='B')

    A_x   B  A_y
0  74.0  10   51
1  90.0  25   32
2  15.0  46   90
3   NaN  35   20